# NLevelFafArea Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassLevelData..::..NLevelFafArea Property
MassLevelData Class See Also
---
The surface area of the intersection of the MassLevelData's level with the mass geometry.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double NLevelFafArea { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NLevelFafArea As Double
	Get
```

Visual C++
---
```text
public:
property double NLevelFafArea {
	double get ();
}
```

# See Also
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace